stokes_flow/velocity_1e-2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         50;

deltaT          0.0001;

writeControl    timeStep;

writeInterval   10000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forces
    {
        type            forces;
        libs            (forces);
        executeControl  onEnd;
        writeControl    onEnd;
        
        patches         (cylinder);
        
        rho             rhoInf;
        rhoInf          1;
        
        CofR            (0 0 0);
        pitchAxis       (0 1 0);
    }
    
    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);
        executeControl  onEnd;
        writeControl    onEnd;
        
        patches         (cylinder);
        
        rho             rhoInf;
        rhoInf          1;
        
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         1e-2;
        lRef            0.4;      // cylinder diameter (2*radius)
        Aref            0.04;     // reference area (diameter * depth = 0.4 * 0.1)
    }
}

// ************************************************************************* //
