stokes_flow/velocity_1e-2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        DICGaussSeidel;
        nCellsInCoarsestLevel 10;
    }

    pFinal
    {
        $p;
        tolerance       1e-7;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        tolerance       1e-6;
        relTol          0;
    }
}

SIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    residualControl
    {
        p               1e-3;
        U               1e-3;
    }

}

relaxationFactors
{
    fields
    {
        p               0.3;
        p_rgh           0.3;
    }
    equations
    {
        U               0.7;
    }
}


PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
    //pRefCell        0;
    //pRefValue       0;
}


// ************************************************************************* //
